{
    "Wordle (Classic) - React & Websockets:03/2024 – 04/2024,University of Toronto:Mississauga, ON": [
        "Created the classic version of the game mordle (found at mordle.io).",
"Created entirely using React and utilized Websockets to broadcast changes of the game to every user currently playing.",
"Created a single shared game that every player on the website would play and the game would restart every 5 min.",
"Created a global timer to let every user know how much time there was left for the current game.",
"Created a global stats section that in real time would let all the players know how many people are currently playing, how many people have won and how many people have lost the current game.",
"Utilized cookies to make it such that the first time the browser visits the website, they get a new username, after that they get the username they got before.",
"Created a stats page displayed the wins ,losses and games played by the user and the group (the group being all the users currently and previously playing the shared game)."],
    
    "Wordle (Solo) - AJAX & Javascript:03/2024,University of Toronto:Mississauga, ON": [
        "Created the solo player version of the game mordle (found at mordle.io) without the timer.",
"First created using Javascript and JQuery and then changed to where every time the Wordle model in our code was consulted in the browser, an Ajax request is made to the nodejs server where the Wordle model actually lives.",
"Created popups for errors that fade away after a certain number of seconds.",
"Created a different Wordle instance for every user and kept them all on the server in an object indexed by the username.",
"Generated random usernames every time the browser visited the website.",
"Created a stats page that kept track of the user’s wins and losses."],

    "Puzzle Games Website - PHP:01/2024 - 02/2024,University of Toronto:Mississauga, ON": [
        "Created a single player puzzle games website using PHP and the model view controller design pattern.",
"Created such that a user must authenticate with an account they previously registered to login to the website before they are allowed to play any games.",
"Created the following puzzle games: Rock Paper Scissors, Guess Game and the Frog Jumping game.",
"Utilized a PostgreSQL database to store user information, the number of wins and losses for the rock paper scissors and the guess game puzzle games, and the number of wins, and total moves used for the frog jumping game.",
"Created a login page that consists of the user and password input fields and a registration button. The user can not get past this page to play games until they authenticate or register a new account.",
"Created a registration page that has simple inputs for the user to create a new account where on a successful user registration, the filled out fields are saved on a PostgreSQL database.",
"Created a game stats page, which displays the number of wins and losses for the puzzle games and for the frog game specifically, instead of the losses, the number of moves is displayed."],

        "Dyanmic Shift Report - VBA, MySQL, Excel:03/2023 - 06/2023,Isowater Corporation:Collingwood, ON" : [
            "Implemented, using Excel VBA and MySQL, a dynamically changing file that updates and changes based on the date entered by a user, to generate a shift report for that day.",
            "Utilized data from a database kept on a remote desktop and manual information from the operator to calculate the Overall Equipment Effectiveness (OEE) percentage during operation that day."
        ],

        "Mobile Water Refinery - Power Automate, Teams, MySQL:02/2023 - 03/2023,Isowater Corporation:Collingwood, ON" : [
            "Designed and Implemented a software that allows people in a teams group to obtain data from a MySQL database (kept on a remote desktop) on their preferred device without connecting to the remote desktop.",
            "Implemented using Microsoft Power Automate Teams (Cloud flows) and Microsoft Power Automate Desktop (Desktop flows).",
            "Implemented such that a single desktop flow running on a remote desktop communicates with multiple cloud flows to provide the requested data to the user in a teams group chat."
        ],

        "Refinery Warnings - Power Automate, Teams, MySQL:02/2023 - 03/2023,Isowater Corporation:Collingwood, ON" : [
            "Designed and Implemented a software that warns people in a teams group chat of any alarms triggered while the refinery is in operation to keep people informed about any issues that may occur.",
            "Implemented using Power Automate Teams (Cloud flows) and Power Automate Desktop (Desktop flows).",
            "Implemented such that every 5 minutes a single desktop flow running on a remote desktop utilizes a MySQL database and communicates with the cloud flow to send any alarms triggered to a teams group chat."
        ],

        "Excel HMI - MySQL, VBA, Excel:10/2022 - 02/2023,Isowater Corporation:Collingwood, ON" : [
            "Designed and Implemented an HMI on an excel file to allow employees to monitor the refinery when in operation using MySQL and Visual Basic for Applications (Excel VBA).",
            "Created to allow multiple people to monitor the refinery synchronously on different devices.",
            "Utilized a MySQL driver to pull data from a Database kept on a Remote Desktop and displayed that data in a user friendly manner allowing people to watch the data change in almost real time.",
            "Implemented a Create Graph button that would allow users to choose all the instruments (such as Temperature Transmitters, Pressure Transmitters, etc.) they would like to graph with the option of a possible secondary Y axis and it would create a new sheet with those instruments graphed against the date and time."
        ],

        "Web Dashboard - HTML, JavaScript, CSS:06/2022,Isowater Corporation:Collingwood, ON": [
            "Optimized an online data logging website to visually display certain pieces of data as the database updated with new information.",
            "Created to make it easier for shareholders and higher ups to see how the refinery performed while in operation."
        ],

        "DAGR - Python (pandas, XlsxWriter), VBA, Excel:06/2022,Isowater Corporation:Collingwood, ON" : [
            "Implemented software using Python (pandas, XlsxWriter) and Excel VBA that automates creating data log files quickly and efficiently.",
            "Runs on a log file pulled from a MySQL database and creates a new log file that has multiple sheets with data sorted and copied into those sheets, graphs built upon that data and any calculations required for data analysis.",
            "Created to optimize and speed up the process of log file creation. Manually creating the file took 1-2 hours for each log file where else this software only takes a couple of minutes."
        ],

    "Software Design - Java:03/2021 – 04/2021,University of Toronto:Mississauga, ON": [
        "Created a back-end of a digital system for video games that allows users to buy or sell access to games in a group of 4.",
        "Worked alongside a theoretical front-end interface that would provide the back-end with transaction data in the form of daily transaction text files, which contain a day’s worth of transactions and user commands.",
    "Used by four types of users, specifically, buyers, sellers, full-standard users and admin users.",
    "Created a product backlog that listed all the tasks needed to be done.",
    "Updated product backlog using the Scrum process where we had to do a code sprint in which we decided which tasks would be done for that week, the person who would be in charge of the tasks and the current status of the tasks."],

    "Movie Website - PHP & MySQL:01/2021,Personal:Brampton, ON": [
        "Constructed a model website after an online movies website.",
"Created a search engine on the website and attached it to a MySQL database using PHP.",
"Updated website to increase movies provided to the user by manually updating database."
    ]

}